
#Область ОбработчикиСобытий

// Начало.БоклачПИ 22.12.2025 homework-13-7
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры // Конец.Боклач 22.12.2025

// Начало.БоклачПИ 22.12.2025 homework-13-7
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ДействуетНаОсновании <> "" И Данные.ДействуетНаОсновании <> Неопределено Тогда
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры // Конец.Боклач 22.12.2025

#КонецОбласти