
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// Начало.БоклачПИ 22.12.2025 homework-13-7
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	СуммаСкидок = ТекущиеДанные.Скидка + Объект.Дораб_СогласованнаяСкидка;
	
	Если СуммаСкидок <= 100 Тогда
		КоэффициентСкидки = (1 - СуммаСкидок / 100);
	Иначе
		КоэффициентСкидки = 0;
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = "Сумма скидок больше 100%";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	РассчитатьСуммуДокумента();
	// Конец.Боклач 22.12.2025
	
КонецПроцедуры

// Начало.БоклачПИ 22.12.2025 homework-13-7
&НаКлиенте
Процедура Дораб_ПересчитатьТаблицу(Команда)
	
	Дораб_ПересчитатьТаблицыСоСкидкой();
	
КонецПроцедуры // Конец.Боклач 22.12.2025

// Начало.БоклачПИ 22.12.2025 homework-13-7
&НаКлиенте
Процедура Дораб_ПересчитатьТаблицыСоСкидкой()
	
	Дораб_ПересчитатьТаблицуСоСкидкой(Объект.Товары);
	
	Дораб_ПересчитатьТаблицуСоСкидкой(Объект.Услуги);
	
КонецПроцедуры // Конец.Боклач 22.12.2025

// Начало.БоклачПИ 22.12.2025 homework-13-7
&НаКлиенте
Процедура Дораб_ПересчитатьТаблицуСоСкидкой(Таблица)
	
	Для Каждого Строка Из Таблица Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;
	
КонецПроцедуры // Конец.Боклач 22.12.2025

// Начало.БоклачПИ 22.12.2025 homework-13-7
&НаКлиенте
Процедура Дораб_СогласованнаяСкидкаПриИзменении(Элемент)
	
	Дораб_СогласованнаяСкидкаПриИзмененииАсинх();
	
КонецПроцедуры // Конец.Боклач 22.12.2025

// Начало.БоклачПИ 22.12.2025 homework-13-7
&НаКлиенте
Асинх Процедура Дораб_СогласованнаяСкидкаПриИзмененииАсинх()
	
	КоличествоСтрокТЧТовары = Объект.Товары.Количество();
	
	КоличествоСтрокТЧУслуги = Объект.Услуги.Количество();
	
	Если КоличествоСтрокТЧТовары = 0 И КоличествоСтрокТЧУслуги = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Изменен процент скидки. Пересчитать таблицы товаров и услуг?";
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, Режим);
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Дораб_ПересчитатьТаблицыСоСкидкой();
	
КонецПроцедуры // Конец.Боклач 22.12.2025
 
&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
