
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Начало.БоклачПИ 22.12.2025 homework-13-7
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		// Заполнение шапки
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, 
			"Договор, Комментарий, Контрагент, Организация");
		
		Организация = ЗначенияРеквизитов.Организация;
		Контрагент = ЗначенияРеквизитов.Контрагент;
		Договор = ЗначенияРеквизитов.Договор;
		Основание = ДанныеЗаполнения;
		Ответственный = Пользователи.ТекущийПользователь();
		Комментарий = ЗначенияРеквизитов.Комментарий;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |ГДЕ
		               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РеализацияТоваровУслугТовары.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = Выборка.Номенклатура;
			НоваяСтрока.Количество = Выборка.Количество;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // Конец.Боклач 22.12.2025

#КонецОбласти

#КонецЕсли